tiborsimon/embedded-tdd-headers/pic/8bit/pic18f8493_tdd.h
#define S40C2                         522
#define SEG40COM2                     523
#define SEG41COM2                     524
#define S41C2                         525
#define S42C2                         526
#define SEG42COM2                     527
#define S43C2                         528
#define SEG43COM2                     529
#define SEG44COM2                     530
#define S44C2                         531
#define S45C2                         532
#define SEG45COM2                     533
#define S46C2                         534
#define SEG46COM2                     535
#define S47C2                         536
#define SEG47COM2                     537
#define SEG0COM3                      538
#define LCDDATA18                     539
#define S00C3                         540
#define S0C3                          541
#define S01C3                         542
#define SEG1COM3                      543
#define S1C3                          544
#define S02C3                         545
#define S2C3                          546
#define SEG2COM3                      547
#define S03C3                         548
#define SEG3COM3                      549
#define S3C3                          550
#define SEG4COM3                      551
#define S4C3                          552
#define S04C3                         553
#define S5C3                          554
#define S05C3                         555
#define SEG5COM3                      556
#define SEG6COM3                      557
#define S6C3                          558
#define S06C3                         559
#define SEG7COM3                      560
#define S7C3                          561
#define S07C3                         562
#define S8C3                          563
#define SEG8COM3                      564
#define S08C3                         565
#define LCDDATA19                     566
#define S9C3                          567
#define SEG9COM3                      568
#define S09C3                         569
#define SEG10COM3                     570
#define S10C3                         571
#define S11C3                         572
#define SEG11COM3                     573
#define S12C3                         574
#define T3CKPS019                     575
#define SEG12COM3                     576
#define S13C3                         577
#define SEG13COM3                     578
#define T3CKPS119                     579
#define S14C3                         580
#define SEG14COM3                     581
#define TMR3CS019                     582
#define SEG15COM3                     583
#define S15C3                         584
#define TMR3CS119                     585
#define LCDDATA20                     586
#define S16C3                         587
#define SEG16COM3                     588
#define SEG17COM3                     589
#define S17C3                         590
#define SEG18COM3                     591
#define S18C3                         592
#define S19C3                         593
#define SEG19COM3                     594
#define S20C3                         595
#define SEG20COM3                     596
#define SEG21COM3                     597
#define S21C3                         598
#define SEG22COM3                     599
#define S22C3                         600
#define S23C3                         601
#define SEG23COM3                     602
#define S24C3                         603
#define LCDDATA21                     604
#define SEG24COM3                     605
#define S25C3                         606
#define SEG25COM3                     607
#define S26C3                         608
#define SEG26COM3                     609
#define SEG27COM3                     610
#define S27C3                         611
#define SEG28COM3                     612
#define S28C3                         613
#define SEG29COM3                     614
#define S29C3                         615
#define SEG30COM3                     616
#define S30C3                         617
#define SEG31COM3                     618
#define S31C3                         619
#define LCDDATA22                     620
#define S32C3                         621
#define SEG32COM3                     622
#define SEG33COM3                     623
#define S33C3                         624
#define S34C3                         625
#define SEG34COM3                     626
#define S35C3                         627
#define SEG35COM3                     628
#define S36C3                         629
#define SEG36COM3                     630
#define SEG37COM3                     631
#define S37C3                         632
#define S38C3                         633
#define SEG38COM3                     634
#define SEG39COM3                     635
#define S39C3                         636
#define LCDDATA23                     637
#define S40C3                         638
#define SEG40COM3                     639
#define SEG41COM3                     640
#define S41C3                         641
#define S42C3                         642
#define SEG42COM3                     643
#define SEG43COM3                     644
#define S43C3                         645
#define SEG44COM3                     646
#define S44C3                         647
#define S45C3                         648
#define SEG45COM3                     649
#define S46C3                         650
#define SEG46COM3                     651
#define S47C3                         652
#define SEG47COM3                     653
#define BAUDCON1                      654
#define ABDEN1                        655
#define ABDEN                         656
#define WUE1                          657
#define WUE                           658
#define BRG16                         659
#define BRG161                        660
#define SCKP                          661
#define TXCKP                         662
#define SCKP1                         663
#define TXCKP1                        664
#define CKTXP                         665
#define RCMT                          666
#define RCIDL                         667
#define RCIDL1                        668
#define RCMT1                         669
#define ABDOVF                        670
#define ABDOVF1                       671
#define PORTA                         672
#define AN0                           673
#define ULPWUIN                       674
#define PORTA_RA0                     675
#define AN1                           676
#define PORTA_RA1                     677
#define SEG16                         678
#define AN2                           679
#define PORTA_RA2                     680
#define VREFM                         681
#define SEG17                         682
#define AN3                           683
#define PORTA_RA3                     684
#define VREFP                         685
#define PORTA_RA4                     686
#define SEG14                         687
#define T0CKI                         688
#define SEG15                         689
#define AN4                           690
#define PORTA_RA5                     691
#define LVDIN                         692
#define CLKO                          693
#define PORTA_RA6                     694
#define OSC2                          695
#define CLKI                          696
#define PORTA_RA7                     697
#define OSC1                          698
#define PORTA_RJPU                    699
#define PORTB                         700
#define INT0                          701
#define PORTB_RB0                     702
#define INT1                          703
#define SEG8                          704
#define PORTB_RB1                     705
#define INT2                          706
#define SEG9                          707
#define PORTB_RB2                     708
#define SEG10                         709
#define CCP2B                         710
#define INT3                          711
#define CCP2_PA2                      712
#define PORTB_RB3                     713
#define SEG11                         714
#define KBI0                          715
#define PORTB_RB4                     716
#define PGM                           717
#define KBI1                          718
#define PORTB_RB5                     719
#define PGC                           720
#define KBI2                          721
#define PORTB_RB6                     722
#define PGD                           723
#define KBI3                          724
#define PORTB_RB7                     725
#define PORTC                         726
#define T13CKI                        727
#define T1OSO                         728
#define PORTC_RC0                     729
#define CCP2C                         730
#define CCP2                          731
#define T1OSI                         732
#define PA2                           733
#define PORTC_RC1                     734
#define CCP1                          735
#define SEG13                         736
#define PA1                           737
#define PORTC_RC2                     738
#define SEG12                         739
#define SCL                           740
#define SCK                           741
#define PORTC_RC3                     742
#define SDA                           743
#define SDI                           744
#define PORTC_RC4                     745
#define SDO                           746
#define PORTC_RC5                     747
#define TX                            748
#define CK                            749
#define PORTC_RC6                     750
#define DT                            751
#define RX                            752
#define PORTC_RC7                     753
#define PORTD                         754
#define SEG0                          755
#define PORTD_RD0                     756
#define PORTD_RD1                     757
#define SEG1                          758
#define PORTD_RD2                     759
#define SEG2                          760
#define PORTD_RD3                     761
#define SEG3                          762
#define SEG4                          763
#define PORTD_RD4                     764
#define SEG5                          765
#define PORTD_RD5                     766
#define SEG6                          767
#define PORTD_RD6                     768
#define PORTD_RD7                     769
#define SEG7                          770
#define SS2                           771
#define PORTE                         772
#define PD2                           773
#define RDE                           774
#define LCDBIAS1                      775
#define RE0                           776
#define BIAS1                         777
#define WRE                           778
#define LCDBIAS2                      779
#define PC2                           780
#define RE1                           781
#define BIAS2                         782
#define PORTE_CS                      783
#define CCP10                         784
#define PB2                           785
#define RE2                           786
#define LCDBIAS3                      787
#define BIAS3                         788
#define COM0                          789
#define CCP9E                         790
#define RE3                           791
#define PC3E                          792
#define PB3E                          793
#define COM1                          794
#define PORTE_RE4                     795
#define CCP8E                         796
#define COM2                          797
#define CCP7E                         798
#define PORTE_RE5                     799
#define PC1E                          800
#define CCP6E                         801
#define COM3                          802
#define PORTE_RE6                     803
#define PB1E                          804
#define CCP2E                         805
#define SEG31                         806
#define PA2E                          807
#define PORTE_RE7                     808
#define PORTF                         809
#define PORTF_RF0                     810
#define SEG18                         811
#define AN5                           812
#define PORTF_RF1                     813
#define SEG19                         814
#define C2OUTF                        815
#define AN6                           816
#define PORTF_RF2                     817
#define AN7                           818
#define SEG20                         819
#define C1OUTF                        820
#define PORTF_RF3                     821
#define AN8                           822
#define SEG21                         823
#define AN9                           824
#define PORTF_RF4                     825
#define SEG22                         826
#define PORTF_RF5                     827
#define SEG23                         828
#define AN10                          829
#define CVREFF                        830
#define PORTF_RF6                     831
#define SEG24                         832
#define AN11                          833
#define PORTF_RF7                     834
#define SEG25                         835
#define SS                            836
#define PORTG                         837
#define SEG30                         838
#define PORTG_RG0                     839
#define C3OUTG                        840
#define SEG29                         841
#define TX2                           842
#define PORTG_RG1                     843
#define CK2                           844
#define RX2                           845
#define SEG28                         846
#define PORTG_RG2                     847
#define DT2                           848
#define SEG27                         849
#define PORTG_RG3                     850
#define SEG26                         851
#define PORTG_RG4                     852
#define VPP                           853
#define PORTG_RJPU                    854
#define RG5                           855
#define MCLR                          856
#define PORTH                         857
#define PORTH_RH0                     858
#define SEG47                         859
#define PORTH_RH1                     860
#define SEG46                         861
#define PORTH_RH2                     862
#define SEG45                         863
#define PORTH_RH3                     864
#define SEG44                         865
#define PORTH_RH4                     866
#define CCP9                          867
#define SEG40                         868
#define PC3                           869
#define PORTH_RH5                     870
#define CCP8                          871
#define PB3                           872
#define SEG41                         873
#define PORTH_RH6                     874
#define CCP7                          875
#define SEG42                         876
#define PC1                           877
#define PORTH_RH7                     878
#define CCP6                          879
#define PB1                           880
#define SEG43                         881
#define PORTJ                         882
#define SEG32                         883
#define PORTJ_RJ0                     884
#define SEG33                         885
#define PORTJ_RJ1                     886
#define SEG34                         887
#define PORTJ_RJ2                     888
#define SEG35                         889
#define PORTJ_RJ3                     890
#define SEG39                         891
#define PORTJ_RJ4                     892
#define SEG38                         893
#define PORTJ_RJ5                     894
#define SEG37                         895
#define PORTJ_RJ6                     896
#define SEG36                         897
#define PORTJ_RJ7                     898
#define LATA                          899
#define LATA0                         900
#define LA0                           901
#define LATA1                         902
#define LA1                           903
#define LATA2                         904
#define LA2                           905
#define LATA3                         906
#define LA3                           907
#define LATA4                         908
#define LA4                           909
#define LATA5                         910
#define LA5                           911
#define LATA6                         912
#define LA6                           913
#define LATA7                         914
#define LA7                           915
#define LATB                          916
#define LB0                           917
#define LATB0                         918
#define LB1                           919
#define LATB1                         920
#define LB2                           921
#define LATB2                         922
#define LB3                           923
#define LATB3                         924
#define LB4                           925
#define LATB4                         926
#define LB5                           927
#define LATB5                         928
#define LB6                           929
#define LATB6                         930
#define LB7                           931
#define LATB7                         932
#define LATC                          933
#define LATC0                         934
#define LC0                           935
#define LATC1                         936
#define LC1                           937
#define LATC2                         938
#define LC2                           939
#define LATC3                         940
#define LC3                           941
#define LATC4                         942
#define LC4                           943
#define LATC5                         944
#define LC5                           945
#define LATC6                         946
#define LC6                           947
#define LATC7                         948
#define LC7                           949
#define LATD                          950
#define LATD0                         951
#define LD0                           952
#define LATD1                         953
#define LD1                           954
#define LATD2                         955
#define LD2                           956
#define LATD3                         957
#define LD3                           958
#define LATD4                         959
#define LD4                           960
#define LATD5                         961
#define LD5                           962
#define LATD6                         963
#define LD6                           964
#define LATD7                         965
#define LD7                           966
#define LATE                          967
#define LATE4                         968
#define LE4                           969
#define LATE5                         970
#define LE5                           971
#define LATE6                         972
#define LE6                           973
#define LATE7                         974
#define LE7                           975
#define LATF                          976
#define LATF0                         977
#define LF0                           978
#define LATF1                         979
#define LF1                           980
#define LF2                           981
#define LATF2                         982
#define LF3                           983
#define LATF3                         984
#define LF4                           985
#define LATF4                         986
#define LF5                           987
#define LATF5                         988
#define LF6                           989
#define LATF6                         990
#define LF7                           991
#define LATF7                         992
#define LATG                          993
#define LATG0                         994
#define LG0                           995
#define LATG1                         996
#define LG1                           997
#define LATG2                         998
#define LG2                           999
#define LATG3                         1000
#define LG3                           1001
#define LATG4                         1002
#define LG4                           1003
#define LATH                          1004
#define LH0                           1005
#define LATH0                         1006
#define LH1                           1007
#define LATH1                         1008
#define LH2                           1009
#define LATH2                         1010
#define LH3                           1011
#define LATH3                         1012
#define LH4                           1013
#define LATH4                         1014
#define LH5                           1015
#define LATH5                         1016
#define LH6                           1017
#define LATH6                         1018
#define LH7                           1019
#define LATH7                         1020
#define LATJ                          1021
#define LATJ0                         1022
#define LJ0                           1023
#define LATJ1                         1024
#define LJ1                           1025
#define LATJ2                         1026
#define LJ2                           1027
#define LATJ3                         1028
#define LJ3                           1029
#define LATJ4                         1030
#define LJ4                           1031
#define LATJ5                         1032
#define LJ5                           1033
#define LATJ6                         1034
#define LJ6                           1035
#define LATJ7                         1036
#define LJ7                           1037
#define TRISA                         1038
#define TRISA0                        1039
#define TRISA_RA0                     1040
#define TRISA1                        1041
#define TRISA_RA1                     1042
#define TRISA2                        1043
#define TRISA_RA2                     1044
#define TRISA3                        1045
#define TRISA_RA3                     1046
#define TRISA_RA4                     1047
#define TRISA4                        1048
#define TRISA_RA5                     1049
#define TRISA5                        1050
#define TRISA_RA6                     1051
#define TRISA6                        1052
#define TRISA_RA7                     1053
#define TRISA7                        1054
#define TRISB                         1055
#define TRISB_RB0                     1056
#define TRISB0                        1057
#define TRISB_RB1                     1058
#define TRISB1                        1059
#define TRISB_RB2                     1060
#define TRISB2                        1061
#define TRISB_RB3                     1062
#define TRISB3                        1063
#define TRISB_RB4                     1064
#define TRISB4                        1065
#define TRISB_RB5                     1066
#define TRISB5                        1067
#define TRISB_RB6                     1068
#define TRISB6                        1069
#define TRISB_RB7                     1070
#define TRISB7                        1071
#define TRISC                         1072
#define TRISC0                        1073
#define TRISC_RC0                     1074
#define TRISC1                        1075
#define TRISC_RC1                     1076
#define TRISC2                        1077
#define TRISC_RC2                     1078
#define TRISC3                        1079
#define TRISC_RC3                     1080
#define TRISC4                        1081
#define TRISC_RC4                     1082
#define TRISC5                        1083
#define TRISC_RC5                     1084
#define TRISC6                        1085
#define TRISC_RC6                     1086
#define TRISC7                        1087
#define TRISC_RC7                     1088
#define TRISD                         1089
#define TRISD_RD0                     1090
